# لیست ها تغییر پذیر هستند
# متد های مهم
mylist = [1,2,3,0,5]
# 1
# به آخر لیست یک آیتم اضافه کردن
mylist.append('new item')
# 2
# اصافه کردن دو آرایه
mylist.extend(['a','b','c'])
# 3
# م ریترن میکن و هم از ته حذف میکند
x = mylist.pop()
# 4
# از یک ایندکس همان را حذف و ریترن میکند
y =mylist.pop(2)
# 5
# لیست را سورت میکند برای اعداد درست جواب میدهد
mylist.sort()
# 6
# برای برعکس کردن بدون ریترن
mylist.reverse()
# 7
# list comprehension
matrix=[[1,2,3],[4,5,6],[7,8,9]]
s = [ row[0] for row in matrix ]
# آرایه ریترن میکند
